app/controllers/pictures_controller.rb

 def create
    # make a new picture with what picture_params returns (which is a method we're calling)
    @picture = Picture.new(picture_params)
    if @picture.save
---
INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "Hello"], ["title", "Jason"], ["url", "google.com"], ["created_at", "2016-06-14 20:21:56.261312"], ["updated_at", "2016-06-14 20:21:56.261312"]]

   def update
     @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]